Revit 2024 API
IATFTranslationServer Interface
 Interface class for external servers implementing ATF translation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public interface IATFTranslationServer : IExternalServer
Visual Basic
Public Interface IATFTranslationServer _
	Inherits IExternalServer
Visual C++
public interface class IATFTranslationServer : IExternalServer
Remarks
 A typical way to use the external server can be:
Implement a server class that derives from this interface
Create a new server object and register it with the service, see ExternalServiceRegistry.
See Also
IATFTranslationServer Members
Autodesk.Revit.DB Namespace